Revit 2024 API
FluidTemperatureSetIterator.Dispose Method
Releases all resources used by the FluidTemperatureSetIterator
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
See Also
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace